[
  {
    "name": "Wrappedify",
    "imageSrc": "wrappedify.png",
    "desc": "Wrappedify is a cool data analysis project I worked on which, as the name suggests, is an on-the-go version of Spotify Wrapped. It uses a Python backend alongside Django to parse a user's listening information (provided through Spotify). Redis and Celery are used for asynchronous data processing. The data dashboard provides robust visualisations of listening history, made using D3.js.",
    "externalLink": "https://wrappedify.herokuapp.com",
    "githubLink": "https://github.com/msohaill/wrappedify",
    "tools": [
      "Python",
      "HTML",
      "CSS",
      "JavaScript",
      "AJAX",
      "jQuery",
      "D3.js",
      "Django",
      "Celery",
      "Redis",
      "Heroku",
      "PostgreSQL"
    ]
  },
  {
    "name": "My Personal Site",
    "imageSrc": "personal-site.png",
    "desc": "Pretty self explanatory, I made my website using TypeScript React and Sass to act like an online portfolio (and to also give me somewhere to host my photography). If you're wondering how Bash fits into all of this, I use a convenient script to add more photos to my gallery! The website is also set up with Google Analytics so I can better understand viewership.",
    "githubLink": "https://github.com/msohaill/personal-site",
    "tools": ["TypeScript", "React", "Sass", "Bash"]
  },
  {
    "name": "Spotify Listening Dashboard",
    "imageSrc": "spotify-tableau.png",
    "desc": "A quick and cool dashboard I threw together while trying to learn some Tableau. I used my extended listening history to analyze my streams over my lifetime usage! I used Python to clean and filter the data and insert it into a PostgreSQL database, which I then connected to my workbook.",
    "githubLink": "https://github.com/msohaill/spotify-tableau",
    "externalLink": "https://public.tableau.com/app/profile/muhammad.sohail5951/viz/MySpotifyListening_16587328880640/Dashboard1",
    "tools": ["PostgreSQL", "Python", "Tableau"]
  },
  {
    "name": "Thousand Words",
    "imageSrc": "thousandwords.jpg",
    "desc": "This is a quick web application I threw together that uses the Socket.io library to allow real-time photo sharing. The photos are displayed as blips on an interactive map (generated through GeoJSON data). Each image lasts for 90 seconds and then is deleted, never to be seen again (unless, of course, you re-upload it!). I used Docker for development and deployment needs and AWS S3 for photo storage and delivery (although this was replaced by Cloudinary due to quota limits).",
    "githubLink": "https://github.com/msohaill/thousand-words",
    "externalLink": "https://thousandwords.vercel.app",
    "tools": ["TypeScript", "React", "Socket.io", "AWS", "Sass", "Express", "Docker"]
  }
]
